## UF Devasmatadas entre 1988 e 2018

In [5]:
import pandas as pd 
import matplotlib.pyplot as plt

%matplotlib inline

In [10]:
df = pd.read_csv('terrabrasilis_legal_amazon_22_7_2019_1566487066817.Desmatamento_Legal_Desde_1988_UF.csv', encoding='latin', delimiter=',')

In [11]:
df.head()

   year  area          loi
0  2018    25    TOCANTINS
1  2018   195      RORAIMA
2  2018  1316    RONDÃNIA
3  2018  2744        PARÃ
4  2018  1490  MATO GROSSO

In [12]:
df.tail()

     year  area          loi
274  1988  5140  MATO GROSSO
275  1988  2450    MARANHÃO
276  1988    60       AMAPÃ
277  1988  1510     AMAZONAS
278  1988   620         ACRE

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279 entries, 0 to 278
Data columns (total 3 columns):
year    279 non-null int64
area    279 non-null int64
loi     279 non-null object
dtypes: int64(2), object(1)
memory usage: 6.6+ KB

In [14]:
list(df.columns)

['year', 'area', 'loi']

In [15]:
df.rename(columns={'year': 'Ano','area': 'Area', 'loi': 'Estado'}, inplace=True)

In [16]:
df.head()

    Ano  Area       Estado
0  2018    25    TOCANTINS
1  2018   195      RORAIMA
2  2018  1316    RONDÃNIA
3  2018  2744        PARÃ
4  2018  1490  MATO GROSSO

## Desmatamento - Ano x Area

In [17]:
AnosGroups = df.groupby("Ano")["Area"].sum().reset_index()

In [24]:
AnosGroups.sort_values(by= "Ano", ascending=False)

     Ano   Area
30  2018   7536
29  2017   6947
28  2016   7893
27  2015   6207
26  2014   5012
25  2013   5891
24  2012   4571
23  2011   6418
22  2010   7000
21  2009   7464
20  2008  12911
19  2007  11651
18  2006  14286
17  2005  19014
16  2004  27772
15  2003  25396
14  2002  21650
13  2001  18165
12  2000  18226
11  1999  17259
10  1998  17383
9   1997  13227
8   1996  18161
7   1995  29059
6   1994  14896
5   1993  14896
4   1992  13786
3   1991  11030
2   1990  13730
1   1989  17770
0   1988  21050

## Estados mais desmatados por KM2

In [22]:
EstadoGroups = df.groupby("Estado")["Area"].sum().reset_index()

In [23]:
EstadoGroups.sort_values(by= "Area", ascending=False)

        Estado    Area
5        PARÃ  148303
4  MATO GROSSO  144457
6    RONDÃNIA   60420
2     AMAZONAS   25538
3    MARANHÃO   25180
0         ACRE   14391
8    TOCANTINS    8678
7      RORAIMA    7707
1       AMAPÃ    1583